{"txt":"Curriculum vitae di\nEmanuele Quattrini\n1. Dati anagrafici\nData di nascita: 23/02/1984 a Roma\nResidenza: Ladispoli (Roma)\nNazionalità: Italiana\n2. Contatti\nE-mail: emanuelequattrini@proton.me\nTelefono: 3713953160\n3. Posizione aspirata\nSviluppatore Kotlin e/o sistemista Linux (o qualsiasi posizione che richieda competenze in \nambito informatico).\nIn questo progetto dimostrativo, ci sono gli elementi dello stack con cui sto lavorando con \nmaggiore interesse:\nhttps://github.com/my-lab-23/jet/tree/master/esperanza\n4. Esperienze lavorative\nDa settembre 2021 (progetti personali)\nProgettazione di applicazioni client-server mobili, desktop e web.\nCodice sorgente app dimostrativa (nella root del repository ci sono altri esempi):\nhttps://github.com/my-lab-23/jet/tree/master/solaria\nTecnologie utilizzate:\nKotlin (Android SDK, Compose Android e Desktop, Ktor, Coroutines).\nData persistence (Firebase, Room, Exposed)\nBuild tool Gradle, IDE (IntelliJ IDEA, Android Studio), GitHub.\nAltre tecnologie: AlarmManager, API REST, Canvas, Jsoup, JSON, Kotlin JS, MapLibre, \nNavController, notifiche, Spring Web, StateFlow, ViewModel, XML layout, Handlebars.java, \nVue (anche con Capacitor per Android).\nSettembre 2021 – Settembre 2022 (progetti personali)\nPreparazione dei dati per l’apprendimento automatico. \n[Per esempio sto scrivendo un programma in Scala che intercetta in tempo reale i tweet con\nun determinato hashtag, li trasforma tramite tecniche di NLP (es. tokenizzazione, \nrimozione stop words, conteggio frequenza parole etc.) e carica i dati su un sito web per la \nvisualizzazione]. https://github.com/my-lab-23\nTecnologie utilizzate: \nLato client –>  Kotlin (Android SDK, Ktor, Compose).  \nLato server –> Scala (Spark, MLlib, Akka, twitter4s, doobie), Python (NumPy, Scikit-Learn, \nPandas, Matplotlib, Psycopg2, PySpark).\nBuild tool (Gradle, Sbt), package manager Conda, IDE (IntelliJ IDEA, PyCharm), GitHub.\nFramework Play, Rasa, Selenium, Auth0, testing JUnit, ScalaTest. \nSettembre 2020 – Settembre 2021 (progetti personali)\nProgettazione e amministrazione di sistemi per l'automazione delle infrastrutture \ninformatiche.\nTecnologie utilizzate: Amazon AWS (VPC per la creazione di reti virtuali sicure, istanze EC2 \nbasate su Red Hat Enterprise Linux e Debian GNU/Linux, IAM e Cognito per la gestione \ndella sicurezza degli account), containerizzazione Docker, virtualizzazione QEMU/KVM.\nMonitoraggio Nagios (aggiunta hosts, plugin, NRPE, check di base, notifiche), \norchestrazione Puppet Bolt per l’invio in parallelo di comandi a gruppi di istanze.\nGennaio 2005 – Settembre 2020 presso Agricola Quattrini\nProgettazione e amministrazione della rete locale dell'azienda.\nTecnologie utilizzate: Debian GNU/Linux, NFS per la condivisione dei file, OpenOffice per la\ncreazione dei documenti, CUPS per la condivisione delle stampanti di rete.\nProgettazione e amministrazione del sito web aziendale (Gennaio 2008 – Dicembre 2012).\nTecnologie utilizzate: Debian GNU/Linux, Apache , Ruby on Rails, PostgreSQL.\nLuglio 2005 – Settembre 2005\nProgettazione di una piattaforma per la gestione di un all'allevamento di bovini nell'ambito\ndi un progetto universitario. https://github.com/my-lab-23\nTecnologie utilizzate: Slackware GNU/Linux, Ruby on Rails versione 0.12.1, PostgreSQL.\n5. Istruzione\nAprile-Giugno 2021 Attestato Teoria delle Reti, Windows Server, Linux Server, Oracle \npresso l’IstitutoCEFI di Roma.\n2003-2005 Crediti formativi presso il dipartimento d’informatica de La Sapienza di Roma.\n2003 Maturità scientifica presso l'istituto Isacco Newton di Roma.\n6. Competenze\nBuona conoscenza di Microsoft Windows e GNU/Linux come postazione di lavoro e dei \nprincipali applicativi (es. posta elettronica, suite ufficio).\nBuona conoscenza dei principi della programmazione e dello shell scripting, in particolare \ndei linguaggi Kotlin, Java, Scala, Typescript, Javascript, Python, Ruby e C (Arduino) oltre a \nSQL, HTML e CSS.\nBuona conoscenza delle piattaforme cloud (es. AWS, Azure).\nBuona conoscenza dei principi dell'amministrazione di rete (TCP/IP, IPv4, IPv6, DHCP, NAT,\nSSH, VPN, NFS, DNS, reverse proxy) e di GNU/Linux e dei principali applicativi in ambito \nserver:\n- database PostgreSQL (jsonb), Oracle, MySQL, Microsoft SQL Server, MariaDB;\n- monitoraggio Nagios (aggiunta hosts, plugin, NRPE, check di base, notifiche);\n- containerizzazione Docker;\n- virtualizzazione QEMU/KVM con Proxmox, Oracle VirtualBox con Vagrant,\n        Vmware (workstation);\n- orchestrazione Ansible, Puppet Bolt.\nLingue: Italiano ed inglese tecnico informatico.\n7. Interessi\nMusica classica, fotografia, scacchi, lettura (saggi e fantascienza).\n"}